using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CollectionsTraining
{
    internal class Serialization
    {
        // Сериализация - процесс перевода какой-либо структуры данных в последовательность битов
        // Десериализация - Восстановление начального состояния структуры данных из битовой последовательности
        // Иначе говоря, сериализация - запись каких-то данных в файл для их сохранения и дальнейшего использования.
        // Можно использовать текстовые файлы .txt, csv, но это ненадежно из-за символов. Для сериализации лучше использовать структурированные файлы, типа xml, а лучше json.
    }
}
